// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

// Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.
// Например, даны 2 матрицы:
// 2 4 | 3 4
// 3 2 | 3 3
// Результирующая матрица будет:
// 18 20
// 15 18

2*3 + 4*3  2*4 + 4*3
3*3 + 2*3  3*4 + 2*3

Операция умножения двух матриц А и В определяется только для случая, когда ЧИСЛО СТОЛБЦОВ МАТРИЦЫ А РАВНО ЧИСЛУ СТРОК МАТРИЦЫ В.

сравниваем житое первой матрицы с итым второй матрицы, 
если разные выводим сообщение не подходит
если ок продолжаем

новая матрица 
элемент итое 
элемент житое = элемент умнож на итое житое второй матрицы
обновить счетчики
